Logs/Logbook_project/src/Catalogs/ЗадачаПроекта/ЗадачаПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачаПроекта</name>
  <basedOn>Catalog.ЗадачаПроекта</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>АвторЗадачи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
</mdclass:Catalog>

Logs/Logbook_project/src/Catalogs/ЗадачаПроекта/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	LogBookОбщегоНазначенияКлиент.ЗаполнитьПериодИзДаты(Период,Объект.ДатаНачала,Объект.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	LogBookОбщегоНазначенияКлиент.ЗаполнитьДатыИзПериода(Период,Объект.ДатаНачала,Объект.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата()
	КонецЕсли;
КонецПроцедуры
